# Database ERD Design

**Books (Core) Database Exercise**

Author: **Shaun van der Merwe**

## Instructions:

1. Create an ERD (figure out how many tables to include and the relationships between them) to represent a database that tracks users and their favorite books.

2. Considerations:
    - Each book has only one author (primary author), but the same author may have written multiple books.
    - Each user has a first name, last name, and email.
    - Save a list of each user's favorite books.
    - Each book has a title and an author (author's whole name as one attribute).
    - Each user can have multiple favorite books, and a book can be the favorite of many users.

3. Use MySQL Workbench for designing the ERD.

4. Hint:
   - When linking two tables with a many-to-many relationship, MySQL Workbench will automatically create a joiner table. It will also automatically make the keys primary keys, which you will want to uncheck.

## ERD Design:

![png](Screenshot 2023-10-26 132549.png))

# Part 2: Create the database in Python

Continue working in Jupyter Notebook with the ERD image.

Rather than creating the database in MySQL Workbench with forward engineering, we are going to develop our Python skills by creating the database in Python using PyMySQL that you practiced in the "MySQL with Python" lesson.

Note that working with MySQL via Python will be a required component of the belt exam, so getting comfortable with it now will help prepare you!

You will need to create a connection. This time, you may wish to call it "books".

```python
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection = "mysql+pymysql://root:root@localhost/books"

In [28]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:toor@127.0.0.1/books"

**Create the Engine:**

In [29]:
engine = create_engine(connection_str)

In [30]:
database_exists(connection_str)

True

**Verify that the database exists. If not create it**

In [31]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

**Books Data**

In [32]:
import pandas as pd
df = pd.read_csv('C:/Users/Shaun/Downloads/books.csv')
df.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

**Add this table to the database**

In [36]:
df.to_sql('books', engine, if_exists = 'replace')

6

**Users Data**

In [37]:
df = pd.read_csv('C:/Users/Shaun/Downloads/users.csv')
df.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

**Add this table to the database**

In [38]:
df.to_sql('users', engine, if_exists = 'replace')

3

**Author Data**

In [39]:
df = pd.read_csv('C:/Users/Shaun/Downloads/authors.csv')
df.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

**Add this table to the database**

In [40]:
df.to_sql('authors', engine, if_exists = 'replace')

5

**favorites Data**

In [41]:
df = pd.read_csv('C:/Users/Shaun/Downloads/favorites.csv')
df.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

**Add this table to the database**

In [42]:
df.to_sql('favorites', engine, if_exists = 'replace')

7

**Testing the database with a query**

In [43]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1